// Задача 40: Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать треугольник с сторонами такой длины.
// Теорема о неравенстве треугольника: каждая сторона треугольника меньше суммы двух других сторон.

Console.Write("Введите 3 числа через пробел: ");
int[] array = Console.ReadLine().Split().Select(int.Parse).ToArray();

if(array[0] + array[1] > array[2] && array[1] + array[2] > array[0] && array[0] + array[2] > array[1])
{
    Console.WriteLine("треугольник существует");
} 
else
{
    Console.WriteLine("треугольник не существует");
}
